clear; clc; cla; close all
f = @(x, B)sqrt(2/pi).*B.^(3/2).*x.^2.*exp(-B.*x.^2./2);
B =1;

syms x
simplify(diff(sqrt(2/pi).*B.^(3/2).*x.^2.*exp(-B.*x.^2./2)));
simplify(diff(sqrt(2/pi).*B.^(3/2).*x.^2.*exp(-B.*x.^2./2), 2));
dy = @(x)-(7186705221432913*x.*exp(-x.^2/2).*(x.^2 - 2))./9007199254740992;% первая производная при В = 1
ddy = @(x)(7186705221432913*exp(-x.^2./2).*(x.^4 - 5*x.^2 + 2))./9007199254740992;% вторая производная при В = 1

x = 0:0.1:6;
plot(x, f(x, B), 0, 0, 'r*')
hold on; grid on; 
xlabel('v'); ylabel('f'); title('sqrt(2/pi).*B.^(3/2).*x.^2.*exp(-B.*x.^2./2)');

figure()
hold on;
plot(x, dy(x), 1.4142, dy(1.4142), '*r');
grid on; xlabel('v'); ylabel('f'); title('первая производная'); 
legend('Производная', 'экстремумы')

figure()
plot(x, ddy(x), 0.6622, ddy(0.6622), 'r*', 2.1358, ddy(2.1358), 'r*')
grid on; xlabel('v'); ylabel('f'); title('вторая производная');
legend('Производная 2', 'точки перегиба')

%1) область определения (-беск, +беск)
%2) ни четная ни нечетная, не периодична
%3) y = 0, при х <=0 при х > 0, y > 0
%4) точек разрыва и вертикальных асимптот нет. Граничные пределы = 0
%5) Наклонные асимптоты y = 0;
%6) первая производная -(7186705221432913*x*exp(-x^2/2)*(x^2 - 2))/9007199254740992
x1 = fzero(dy, 1.3); %1.4142 максимум
%7) Вторая производная (7186705221432913*exp(-x^2/2)*(x^4 - 5*x^2 + 2))/9007199254740992
xx1 = fzero(ddy, 0.75); %0.6622 точка перегиба 
xx2 = fzero(ddy, 2.1); %2.1358 точка перегиба 
%Выпуклости вниз при х = (0, 0.6622] U [2.1358, +inf)
%Выпуклости вверх при х = [0.6622, 2.1358]

figure()
x = 0:0.01:3;
hold on;
for B = 2:2:6
    plot(x, f(x, B));
end
grid on; xlabel('v'); ylabel('f'); title('График при разных значениях В'); 
legend('в = 2', 'B = 4', 'B = 6');
%Чем больше B и тем выше и левее график к оси Оу, 
%а значит меньше температура и больше масса молекул