clear; clc; cla; close all
y = @(x)((x.^3-2*x.^2)./(x-3)).^(1/2);
%поиск производных
syms x
simplify(diff(((x.^3-2*x.^2)./(x-3)).^(1/2)));
simplify(diff(((x.^3-2*x.^2)./(x-3)).^(1/2), 2));
dy = @(x)(x.*(2.*x.^2 - 11*x + 12))./(2*(x - 3).^2.*((x.^2.*(x - 2))./(x - 3)).^(1/2));% первая производная
ddy = @(x)(x.*(11*x - 24))./(4*(x - 2).*(x - 3).^3.*((x.^2.*(x - 2))./(x - 3)).^(1/2));% вторая производная
%графики
x = [-10:0.01:2, 3:0.01:10];
hold on; grid on; 
plot(x, y(x)); plot(x, -x-0.5, 'r');  plot([0 2], [y(0), y(2)], 'g*');plot(x, x+0.5, 'r');
xlabel('x'); ylabel('y'); title('((x.^3-2*x.^2)./(x-3)).^(1/2)'); %ylim([-1 1]); xlim([x(1), x(end)])
legend('Функция', 'асимптоты', 'нули')

figure()
subplot(1, 2, 1)
hold on;
plot(x, dy(x))
grid on; xlabel('x'); ylabel('y'); title('первая производная'); 

subplot(1, 2, 2)
x = [-5:0.01:2, 3:0.01:10];
hold on;
plot(x, dy(x)); plot(1.5, dy(1.5), 'r*', 4, dy(4), 'r*')
grid on; xlabel('x'); ylabel('y'); title('первая производная'); ylim([-1 1]); xlim([x(1), x(end)])
legend('Производная', 'экстремумы')

figure()
x = [-20:0.01:2, 3:0.01:20];
plot(x, ddy(x))
grid on; xlabel('x'); ylabel('y'); title('вторая производная'); ylim([-1 1]); xlim([x(1), x(end)])

%Анализ
%1) область определения (-беск, 2] U [3, +беск)
%2) ни четная ни нечетная, не периодична
%3) Нули:
x1 = fzero(y, 0);% 0 
x2 = fzero(y, 2);% 2 
%функция неотрицательна на всех промежутках
%4) Разрыв второго рода на промужутке х = (2, 3) lim правый = +беск, lim
%левый = 2
%Вертик. асимптоты: x = 3
%5) Наклонные асимптоты:
syms x
k = limit(((x.^3-2*x.^2)./(x-3)).^(1/2)./x, x, -inf);% -1
b = limit(((x.^3-2*x.^2)./(x-3)).^(1/2)-k*x, x, -inf);% -0.5
%y = -x-0.5
k = limit(((x.^3-2*x.^2)./(x-3)).^(1/2)./x, x, +inf);% 1
b = limit(((x.^3-2*x.^2)./(x-3)).^(1/2)-k*x, x, +inf);% 0.5
%y = x+0.5
%6) первая производная (x.*(2.*x.^2 - 11*x + 12))./(2*(x - 3).^2.*((x.^2.*(x - 2))./(x - 3)).^(1/2))
xx1 = fzero(dy, 1);% 1.5
xx2 = fzero(dy, 4);% 4
%Функция возрастает при х = (-inf, 0]U[4, +inf)
% Функция убывает при х = (-inf, 0)U[1.5, 2)U(4, 4]
%7) Вторая производная (x.*(11*x - 24))./(4*(x - 2).*(x - 3).^3.*((x.^2.*(x - 2))./(x - 3)).^(1/2))
%точек перегиба нет. Функция выпукла вниз при х = (-inf, 0)U(3, +inf), 
%Функция выпукла вверх при х = (0, 2)
