clear; clc; cla; close all;
y = @(x)(x.^4+2*x.^2+x+2)./(x.^3+2*x.^2+x+2);
syms x
simplify(diff((x.^4+2*x.^2+x+2)./(x.^3+2*x.^2+x+2)));
simplify(diff((x.^4+2*x.^2+x+2)./(x.^3+2*x.^2+x+2), 2));
dy = @(x)(x.^2.*(x.^4 + 4.*x.^3 + x.^2 + 6.*x - 6))./(x.^3 + 2.*x.^2 + x + 2).^2;% первая производная
ddy = @(x)(2.*x.*(5.*x.^5 + 3.*x.^4 + 27.*x.^3 + 19.*x.^2 + 18.*x - 12))./(x.^3 + 2.*x.^2 + x + 2).^3;% вторая производная
x = -10:0.1:10;
hold on; grid on;
plot(x, y(x), x, x-2, 'r')
line([-2 -2], [-50 50], 'Color','r')
xlabel('x'); ylabel('y'); title('(x.^4+2*x.^2+x+2)./(x.^3+2*x.^2+x+2)');
legend('График', 'асимптоты')

figure()
x = -10:0.01:2;
hold on;
plot(x, dy(x))
plot(-4.1854, dy(-4.1854), 'r*', 0, dy(0), 'r*', 0.6790, dy(0.6790), 'r*')
grid on; ylim([-5, 5]);
xlabel('x'); ylabel('y'); title('первая производная');legend('Производная', 'экстремумы')

figure()
x = -3:0.001:0;
plot(x, ddy(x))
grid on; ylim([-10000, 10000]);
xlabel('x'); ylabel('y'); title('вторая производная');

%1) область определения (-беск, -2)U(-2, +беск)
%2) ни четная ни нечетная, не периодична
%3) нулей нет (по графику)
%4) Разрыв второго рода в х=-2, lim y(-2-0) = -беск, lim y(-2+0) = +беск
%Вертик. асимптоты: x = -2
%5) Наклонные асимптоты:
syms x
k = limit((x.^4+2*x.^2+x+2)./(x.^3+2*x.^2+x+2)./x, x, inf);% 1
b = limit((x.^4+2*x.^2+x+2)./(x.^3+2*x.^2+x+2)-k*x, x, inf);% -2
%y = x-2
%6) первая производная (x.^2.*(x.^4 + 4.*x.^3 + x.^2 + 6.*x - 6))./(x.^3 + 2.*x.^2 + x + 2).^2
x1 = fzero(dy, -4.2); %-4.1854 максимум
x2 = fzero(dy, 0);% 0 стацирнарная точка
x3 = fzero(dy, 0.75);%0.6790 минимум
%Функция возрастает при х = (-беск, -4.1854]U[0.679, +беск)
%функция убывает при х = [-4.1854, 2)U(2, 0)U(0, 0.679]
%7) Вторая производная (2*x*(5*x^5 + 3*x^4 + 27*x^3 + 19*x^2 + 18*x - 12))/(x^3 + 2*x^2 + x + 2)^3
%точек перегиба нет, функция имеет выпуклость вверх до -2, выпуклость вниз
%- после -2
