%Исследовать систему на совместность и найти общее решение. 
%Для однородной системы найти фундаментальную систему решений. Сделать проверку.
clear; clc; 
A = [2 1 3 1; 3 5 5 2; 2  2 -1 7; -6 -3 -9 -3];
B = [6; 4; 7; 1];
C = [A B];
R = [rank(A) rank(C) 4]
syms x1 x2 x3 c4
[x1 x2 x3] = solve(2*x1+x2+3*x3==6-c4, 3*x1+ 5*x2+ 5*x3==4-2*c4, 2*x1+2*x2-x3 ==7- 7*c4, -6*x1-3*x2-9*x3==1+3*c4, x1, x2, x3)


X=pinv(A)*B 
A1 = A; A2 = A; A3 = A; A4 = A; 
A1(:,1) = B; A2(:,2) = B; A3(:,3) = B; A4(:,4) = B; 
x1 = det(A1) / det(A); 
x2 = det(A2) / det(A); 
x3 = det(A3) / det(A); 
x4 = det(A4) / det(A); 
R=[x1;x2;x3;x4]


