%ѕривести уравнение кривой второго пор€дка к каноническому виду и определить ее тип. 
%Ќайти начало и базис соответствующей системы координат и угол еЄ поворота относительно исходной. 
%»зобразить эту кривую, начало координат и базисные векторы в старой и новой системах координат.
clear; clc; cla; close all;
syms x y t x1 y1;
f = x^2-2*x*y+y^2-10*x-6*y+25;%=0
%x=x1*cos(t)-y1*sin(t);
%y=x1*sin(t)+y1*cos(t);
F = collect(subs(subs(f, x, x1*cos(t)-y1*sin(t)), y, x1*sin(t)+y1*cos(t)));
solve((2*sin(t)^2 - 2*cos(t)^2)*x1*y1, t);% = pi/4
subs(F, t, pi/4); % 2*y1^2 + 2*2^(1/2)*y1 - 8*2^(1/2)*x1 + 25 = 0
%2*(y+2^(-1/2))^2-8*2^(1/2)*x)+24.5=0
%(y+2^(-1/2))^2 = 4*2^(1/2)*x) - 49/4          !канонический вид, парабола!
collect(2*(y+2^(1/2)/2)^2-8*2^(1/2)*x+24.5);
ezplot('(-8*2^(1/2))*x + 2*(y + 2^(-1/2))^2 + 49/2');
grid on; hold on;

p = 8^(1/2); y0 = -2^(-1/2); 
x0 = solve(subs((-8*2^(1/2))*x + 2*(y + 2^(-1/2))^2 + 49/2, y, y0));
plot (x0, y0, '*k');
quiver(-6, 0, 12, 0, 0, 'k'); quiver(0, -6, 0, 12, 0, 'k');
quiver(0, 0, 6*cos(-pi/4)-0*sin( -pi/4), 6*sin(-pi/4)+0*cos(-pi/4), 0, 'r'); 
quiver(0, 0, 0*cos(-pi/4)-6*sin( -pi/4), 0*sin(-pi/4)+6*cos(-pi/4), 0, 'r');
legend('ѕарабола', '¬ершина(2.1655 , -0.7071)', 'ќх новой системы', 'ќу новой системы', 'ќх старой системы', 'ќн старой системы');