%2.	Привести уравнение кривой второго порядка  к каноническому виду и определить ее тип. Изобразить эту кривую и ее характеристики. 
clear; clc; cla; close all; 
%9x^2+4y^2-18x+16y-11=0
%(x-1)^2/4+(y+2)^2/9 = 1
%(x+2)^2/9+(y-1)^2/4 = 1 эллипс
a = 3; b = 2; c = sqrt(a^2-b^2); x0=-2; y0=1;
ezplot('(x+2)^2/9+(y-1)^2/4 = 1');
grid on; hold on;
plot([x0, x0+a], [y0, y0], '--g');
plot([x0, x0], [y0, y0+b], '--r');
plot(x0, y0, 'ok', 'MarkerSize', 10);
plot([x0-c, x0+c], [y0, y0], '*b', 'MarkerSize', 10);

legend('Эллипс', 'а', 'b', '(-2, 1)', 'Фокусы');