%Постройте график функции   и график ее производной. Укажите промежутки возрастания и убывания функции  . 
%Концы промежутков найдите с помощью функции fzero (как нули производной). 
clear; clc; cla; close all;
x = -5:0.1:5;
F = 0.25*x.^4-3*x.^2+2*x-2;
subplot(2, 1, 1);
plot(x, F);
hold on; grid on; xlabel('x'); ylabel('f'); title('f(x)'); 
f = x.^3-6*x+2;
subplot(2, 1, 2);
plot(x, f);
hold on; grid on; xlabel('x'); ylabel('fпр'); title('fпр(x)'); 

fun = @(x) x.^3-6*x+2;
x1 = fzero(fun, -3);
x2 = fzero(fun, 0);
x3 = fzero(fun, 2);

subplot(2, 1, 1);
x = [x1, x2, x3];
F = @(x)0.25*x^4-3*x^2+2*x-2;
plot(x1, F(x1), '*', x2, F(x2), '*', x3, F(x3), '*');
legend('f(х)','(-2.6, -16.05)', '(0.34, -1.66)', '(2.26, -6.28)')

subplot(2, 1, 2);
f = @(x)x^3-6*x+2;
plot(x1, f(x1), '*', x2, f(x2), '*', x3, f(x3), '*');
legend('fпр(х)', '(-2.6, 0)', '(0.34, 0)', '(2.26, 0)')
%f(x) убывает при х = (-беск; -2.6017], [0.3398; 2.2618]
%f(x) возрастает при х = [-2.6016; 0.3398], [2.2618; +беск)