%а) Напишите уравнение, описывающее положение доски. Проверьте результат графически, построив в системе координат   
%эллипс и график уравнения доски. б) На сколько выше поверхности трубы окажется муха в моменты, когда ее сдвиг 
%вправо (вдоль поверхности земли) составит 1, 2, 3, …, 15 см?
clear; clc; cla; close all;

a = 0.77; b = 0.63; x0 = 0; y0 = b-0.28;
%c = sqrt(a^2-b^2);
[X,Y,Z] = ellipsoid(x0,y0,0,a,b,0, 50);
surfl(X, Y, Z); shading interp;
xlabel('x'); ylabel('y');view(0,90); hold on; grid on;
plot([-1, 1], [0 0], 'b', [-1, 1], [-0.28 -0.28], 'b');

%(x+0.28)^2/a^2+y^2/b^2=1
h = 0.6;
syms x;
M = solve((x-x0)^2/a^2+(h-y0)^2/b^2-1);% x = -0.7068, M(-0.7068, 0.6) точка касания
Mx = M(1, 1);
y = @(x)sqrt(1-(x-x0).^2/a^2)*b+y0;
k = -b*Mx/(a*sqrt(a^2-(Mx-x0)^2));
syms O;
O = solve(k.*Mx+O-h);% = 1.9379
x = -1:0;
Y1 = @(x)k*x+O;% y = -b*Mx/(a*sqrt(a^2-(Mx-x0)^2))*x + O - уравнение положения доски
plot(x, Y1(x), 'r', Mx, h, 'r*')
for dx = 1:15
    dh(1, dx) = dx/100;
    dh(2, dx) = Y1(Mx+dx/100)-y(Mx+dx/100);
end
dh
xlabel('x, м'); ylabel('h, м'); title('Труба и муха'); 
legend('Труба', 'Ох', 'Зарытая часть', 'доска', 'муха');