%Вычислить предел. В одной системе координат построить в окрестности точки x0
%график числителя и функции, получившейся из него после замены на эквивалентную, в другой системе координат -
%график знаменателя и функции, получившейся из него после замены на
%эквивалентну.
clear; clc; cla; close all;
%8
x08 = pi/4;
x = pi/4-1:0.01:pi/4+1; d = 0.001;
f8 = (sqrt(2)-2*cos(x))./sin(x-pi/4)
F8 = @(x)(sqrt(2)-2*cos(x))./sin(x-pi/4);
lim8 = (F8(x08+d)+F8(x08-d))/2% = 1.414

subplot(1, 2, 1);
g81 = sqrt(2)-2*cos(x);%функция числителя
g82 = sqrt(2)-2-x.^2;%функция числителя после замены на эквивалентную
plot(x, g81); hold on; grid on; 
plot(x, g82);
xlabel('x'); ylabel('y'); title('график числителя'); legend('sqrt(2)-2*cos(x)', 'sqrt(2)-2-x.^2');
subplot(1, 2, 2);
v81 = sin(x-pi/4);%функция знаменателя 
v82 = x-pi;%функция знаменателя после замены на эквивалентну.
plot(x, v81); hold on; grid on; 
plot(x, v82);
xlabel('x'); ylabel('y'); title('график знаменателя'); legend('sin(x-pi/4)', 'x-pi');

%9
x09 = 10^100;
syms x;
f9 = x.*(3^(1./x)-1);
lim9 = log(3)%после замены функции на эквивалентну
%F9 = @(x)x*(3^(1/x)-1);
x = -1:0.05:1;
g91 = 3.^(1./x)-1;%функция числителя
g92 = log(3);%функция числителя после замены на эквивалентную
figure()
subplot(1, 2, 1);
plot(x, g91); hold on; grid on; 
plot(x, g92, '.');
xlabel('x'); ylabel('y'); title('график числителя'); legend('y = 3^(1./x)-1', 'y = log(3)');

subplot(1, 2, 2);
v91 = 1./x;%функция знаменателя 
v92 = 1;%функция знаменателя после замены на эквивалентну.
plot(x, v91); hold on; grid on; 
plot(x, v92, '.');
xlabel('x'); ylabel('y'); title('график знаменателя'); legend('y = 1/x', 'y = 1');


