%Доказать по определению, найдя общую формулу для d аналитически (задание из БДЗ по ОМА). Найти значения
% ?(0.01), ?(0.001), решив соответствующие неравенства в MatLab. Сравнить со
%значениями, получающимися по найденной формуле. Сравнение оформить в виде таблицы. Сделать графическую иллюстрацию.
%2
clear; clc; cla; close all;
x0 = 1; E1 = 0.01; E2 = 0.001; a = 4.5;
syms x d E;
f = simplify((x^4+x^3+x^2-3)/(x^2-1))
%abs(x-1)<d;
%abs(f-a)<E;
simplify(abs(f-a)<E);% abs(2*x^3 + 4*x^2 - 3*x - 3)/(2*abs(x + 1)) < E
%abs(2*x^3 + 4*x^2 - 3*x - 3)*abs(x-1)/(2*abs(x^2 - 1)) < E
%abs(x-1)<E*2*abs(x^2 - 1)/abs(2*x^3 + 4*x^2 - 3*x - 3);
d<E*2*abs(x^2 - 1)/abs(2*x^3 + 4*x^2 - 3*x - 3);    
x = 0.6;
f = (x^3 + 2*x^2 + 3*x + 3)/(x + 1);
while abs(f-a)>E1
    x = x+0.0001;
    f = (x^3 + 2*x^2 + 3*x + 3)/(x + 1);
end
d11=abs(x-0.0001-x0)% = 0.0037
x = 1.2;
f = (x^3 + 2*x^2 + 3*x + 3)/(x + 1);
while abs(f-a)>E1
    x = x-0.0001;
    f = (x^3 + 2*x^2 + 3*x + 3)/(x + 1);
end
d12=abs(x+0.0001-x0) % = 0.0037
x = 0.6;
f = (x^3 + 2*x^2 + 3*x + 3)/(x + 1);
while abs(f-a)>E2
    x = x+0.0001;
    f = (x^3 + 2*x^2 + 3*x + 3)/(x + 1);
end
d21=abs(x-0.0001-x0)% = 0.0004
x = 1.2;
f = (x^3 + 2*x^2 + 3*x + 3)/(x + 1);
while abs(f-a)>E2
    x = x-0.0001;
    f = (x^3 + 2*x^2 + 3*x + 3)/(x + 1);
end
d22=abs(x+0.0001-x0) % = 0.0004

x = 0:0.01:2;
f = (x.^4+x.^3+x.^2-3)./(x.^2-1);
plot(x, f, x0, a, 'o'); grid on;
xlabel('x'); ylabel('y'); title('f = (x^4+x^3+x^2-3)/(x^2-1)'); legend('f(x)', 'a (1, 4.5)');
