%Вычислить значения
%n0 в MatLab. Сравнить со значениями, получившимися в БДЗ-1 по математическому анализу.
%Сравнение оформить в виде таблицы. Сделать графическую иллюстрацию.
%1
clear; clc; cla; close all;
E1 = 0.01; E2 = 0.001; d = 0.00001; a = 2;
syms n;
n = 0:100;

f = ((n+1).^3+(n+2).^3)./(n.^3+200);
F = @(n)((n+1)^3+(n+2)^3)/(n^3+200);
abs(f-a)<E1;
plot(n, f);
xlabel('x'); ylabel('y'); title('((n+1)^3+(n+2)^3)/(n^3+200)');
grid on;
n = 10;
f = ((n+1)^3+(n+2)^3)/(n^3+200);
f-a-E1==0;%т.к f-a положителен при n>6

while f-a-E1>0
    n = n+1;
    f = ((n+1)^3+(n+2)^3)/(n^3+200);
end
n1 = n-1, n=100;
while f-a-E2>0
    n = n+1;
    f = ((n+1)^3+(n+2)^3)/(n^3+200);
end
n2 = n-1

