%Методом итераций найти корни уравнения с указанной погрешностью a E=10^-4
clear; clc; cla;
%x^3-3*x^2+8*x+10=0
%x=(x.^3-3*x.^2+10)/8
x=-4:0.1:6;
y1=x;
plot(x, y1);
grid on; hold on; 
y2=(x.^3-3*x.^2+10)/8;
plot(x, y2);
legend('x', '(x.^3-3*x.^2+10)/8')
title('x=(x.^3-3*x.^2+10)/8')
xlabel('x'), ylabel('f')
%x ~~-2.3, 1, 4,3

%f'(x)=(3*x.^2-6*x)/8 для -2.3 >1, для 1 по модулю <1, для 4.3 >1 =>
x0=3;
x=1;
while abs(x-x0)>=0.00001
    x0=x;
    x=(x0^3-3*x0^2+10)/8;
end
x1 = x

format short
%x=sqrt((x^3+8*x+10)/3)
%f'(x)=(3*x^2+8)/sqrt((x^3+8*x+10)/3)/6 для -2.3 по модулю >1 для 4.3 >1

%x=(3*x^2-8*x-10)^(1/3)
%f'(x)=(6*x-8)/(3*x^2-8*x-10)^(2/3)/3 для -2.3 по модулю <1 для 4.3 >1

x0=3;
x=4.3;
while abs(x-x0)>=0.00001
    x0=x;
    x=-(abs((3*x^2-8*x-10))^(1/3));
end
x2 = -x

x0=3;
x=-2.3;
while abs(x-x0)>=0.00001
    x0=x;
    x=(abs((3*x^2-8*x-10))^(1/3));
end
x3 = -x