%Методом итераций найти корни уравнения с указанной погрешностью a E=10^-4
clear; clc; cla;
%f = 4*exp(x)==5*(x+1);

%x=log(5*(x+1)/4)
x=-1:0.1:1;
y1=x;
plot(x, y1)
hold on; grid on;
y2=log(5*(x+1)/4);
plot(x, y2);
grid on; 
%x1=(-0.6, -0.4), x2=(0.8, 0.9)

%f'(x)=1/(x+1) на промежутке [0.8, 0.9] <1 =>
x0=3;
x=0.8;
while abs(x-x0)>=0.0001
    x0=x;
    x=log(5*(x0+1)/4);
end
x1 = x

%f'(x)=1/(x+1) на промежутке [-0.6, -0.4] >1 =>
%x=4*exp(x)/5-1
%f'(x)=4/5*exp(x) на промежутке [-0.6, -0.4] <1 =>
x0=3;
x=-0.6;
while abs(x-x0)>=0.0001
    x0=x;
    x=4*exp(x)/5-1;
end
x2 = x

legend('x', 'log(5*(x0+1)/4)')
title('x=log(5*(x+1)/4)')
xlabel('x'), ylabel('f')


