%4.	Установить взаимное расположение прямой L и плоскости ?. 
clear; clc; cla; close all;

A=3; B=-1; C=6; D=-12;
x1=1; y1=-1; z1=4; d1=-6;
x2=2; y2=1; z2=-1; d2=3;

L=[x1 y1 z1; x2 y2 z2];
b=[-d1; -d2];
%найдем точку с z=0
L1=[x1 y1; x2 y2];
Xx=inv(L1)*b

M=[1, -5, 0];
n1=[x1, y1, z1];
n2=[x2 y2 z2];
q=cross(n1, n2);
%вторая точка для у=0
M1 = M + q*2;
%M и M1 принадлежат прямой. Подставим их значения в уравнение плоскости
S=A*M(1)+B*M(2)+C*M(3)+D==0%ложь значит прямая не принадлежит плоскости
dot=dot(q, [A B C])%=0 значит прямая параллельна плоскости


x=-5:0.5:5; y=-5:0.5:5; z=-5:0.5:5;
plot3(x, y, z);
hold on,axis equal, axis square, grid on
[X,Y]= meshgrid(x,y); % координаты узлов сетки
Z1 = (-x1*X-y1*Y-d1)/z1;
Z2 = (-x2*X-y2*Y-d2)/z2;
Z3 = (-A*X-B*Y-D)/C;

plot3(1,-5,0,'*r','MarkerSize',10)
surf(X, Y, Z3);
line([M1(1) M(1)], [ M1(2) M(2)], [M1(3) M(3)],'Color','r','LineWidth',4);


mesh(X, Y, Z2);
%plot3(X,Y,Z1, '*k', 'MarkerSize', 2)

ylim([-5 5]);
line([-5 0 0;5 0 0],[0 -5 0;0 5 0],[0 0 -35;0 0 35],'Color', 'black');
xlabel('x'), ylabel('y'), zlabel('z')
title('Прямой L и плоскость а')

legend('', 'M(1 -5 0)', 'заданная плоскость', 'заданная прямая');

