%1.	Лежат ли на одной прямой точки А(2,-3,1), В(0,-11,3) и С(4,5,-1). 
%В случае положительного ответа, написать уравнение этой прямой, проходящей через точку С.
clear; clc; cla; close all;
A  =[2 -3 1];
B=[0 -11 3];
C=[4 5 -1];
AC = C - A; %направляющий
AB = B-A;
cross(AC, AB) %= 0 => лежат на одной прямой
%(x-4)/(2)=(y-5)/8=-(z+1)/2

X=-11:0.5:5; Y=-11:0.5:5; Z=-11:0.5:5;
plot3(X,Y,Z, 'w');
hold on; grid on;
plot3([B(1) C(1)],[B(2) C(2)],[B(3) C(3)]);
plot3(A(1), A(2), A(3),'*');
plot3(B(1), B(2), B(3),'*');
plot3(C(1), C(2), C(3),'*');

set(gca, 'XGrid', 'on', 'YGrid', 'on', 'ZGrid', 'on');
xlabel('x'); ylabel('y'); zlabel('z'); 
title('(x-4)/(2)+(y-5)/8-(z+1)/2');
legend('', '(x-4)/(2)+(y-5)/8-(z+1)/2', 'A', 'B', 'C');
%xlim([-1 5]); ylim([-12 6]); zlim([-2 4]); 
