%3.	Осуществите сдвиг прямоугольного треугольника. 
%Треугольник и параметры преобразования задайте самостоятельно. 
clear; clc; cla; close all;
x = 0; y = 0; a = 4; b = -3; O = [a b];
A = [4 5]; B = [4 2]; C = [0 5];
A1 = A+O; B1 = B+O; C1 = C+O;

hold on; grid on;
line([A(1) B(1) C(1); C(1) A(1) B(1)], [A(2) B(2) C(2); C(2) A(2) B(2)], 'Color', 'r');
line([A1(1) B1(1) C1(1); C1(1) A1(1) B1(1)], [A1(2) B1(2) C1(2); C1(2) A1(2) B1(2)], 'Color', 'g');

plot(0, 0, 'ro', a, b, 'go', 'MarkerSize',10);
quiver(-1, 0, 10, 0, 0, 'Color', 'k', 'LineWidth', 2)
quiver(0, -3, 0, 11, 0, 'Color', 'k', 'LineWidth', 2)
xlabel('x'); ylabel('y'); title('Сдвиг прямоугольного треугольника'); 
legend('AB', 'BC', 'CA','A1B1','B1C1','C1A1','Изначальная Т. отсчета. О(0, 0)', 'Новая Т. отсчета О1(4, -3)');
